---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndValueDistance
source: html/17b83811-5aae-7faf-a61f-9dbcf927fe9e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndValueDistance Property

"End Attachment Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentEndValueDistance { get; }
```